# Python with Mysql 1

This jupyter notebook, connects to a mysql server running on a location machine using the mysql.connector driver, connects with already created databases, creates a table, inserted records into this table using pandas and a CSV file gotten from **kaggle**, perform some queries, and some aggreagate functions.

**Note:** The csv I read in is also in the **data** folder, so you can use it to replicate this notebook if needed (just change the necessary part)

In [1]:
import mysql.connector
import pandas as pd
import numpy as np

#### Creating a connection to Mysql

In [2]:
conn = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Esiev@25"
)

print(conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F3543DFD30>

#### Getting all databases inthe connection

In [3]:
mycursor = conn.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

#### Connecting to a particular mysql database "mydb"

In [4]:
conn1 = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Esiev@25",
  database = "mydb"
)

#### Creating a table in the database "mydb"

The code cell is necessary in case we want to rerun this jupyter notebook at a later time.

In [5]:
mycursor1 = conn1.cursor()

mycursor1.execute("DROP TABLE imdbtop250")

In [6]:
mycursor1 = conn1.cursor()

mycursor1.execute("CREATE TABLE imdbtop250(Ranking int, IMDByear varchar(255), IMDBlink varchar(255), Title varchar(255), Date varchar(255), RunTime int, Genre varchar(255), Rating double, Score int, Votes int, Gross double, Director varchar(255), Cast1 varchar(255), Cast2 varchar(255), Cast3 varchar(255), Cast4 varchar(255))")

#### Returning a list of tables in mydb

In [7]:
mycursor1.execute("SHOW TABLES")
for x in mycursor1:
    print(x)

('airbnb_nyc',)
('imdbtop250',)

#### Inserting records from a csv file into the imdb250 table

In [8]:
df = pd.read_csv(r"C:\Users\eemer\Documents\SCHOOL\Data science project\imdbTop250.csv", index_col=False, delimiter=',')
df.head(5)

,Ranking,IMDByear,IMDBlink,Title,Date,RunTime,Genre,Rating,Score,Votes,Gross,Director,Cast1,Cast2,Cast3,Cast4
0,1,1996,/title/tt0076759/,Star Wars: Episode IV - A New Hope,1977,121,"Action, Adventure, Fantasy",8.6,90.0,1299781,322.74,George Lucas,Mark Hamill,Harrison Ford,Carrie Fisher,Alec Guinness
1,2,1996,/title/tt0111161/,The Shawshank Redemption,1994,142,Drama,9.3,80.0,2529673,28.34,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler
2,3,1996,/title/tt0117951/,Trainspotting,1996,93,Drama,8.1,83.0,665213,16.50,Danny Boyle,Ewan McGregor,Ewen Bremner,Jonny Lee Miller,Kevin McKidd
3,4,1996,/title/tt0114814/,The Usual Suspects,1995,106,"Crime, Drama, Mystery",8.5,77.0,1045626,23.34,Bryan Singer,Kevin Spacey,Gabriel Byrne,Chazz Palminteri,Stephen Baldwin
4,5,1996,/title/tt0108598/,The Wrong Trousers,1993,30,"Animation, Short, Comedy",8.3,NaN,53316,NaN,Nick Park,Peter Sallis,Peter Hawkins,NaN,NaN

From the above pandas dataframe, since we have missing represented as **NaN**, we need to convert all this to values mysql can understand which is **None**

In [9]:
df1 = df.replace({np.nan:None})
df1.head(5)

,Ranking,IMDByear,IMDBlink,Title,Date,RunTime,Genre,Rating,Score,Votes,Gross,Director,Cast1,Cast2,Cast3,Cast4
0,1,1996,/title/tt0076759/,Star Wars: Episode IV - A New Hope,1977,121,"Action, Adventure, Fantasy",8.6,90.0,1299781,322.74,George Lucas,Mark Hamill,Harrison Ford,Carrie Fisher,Alec Guinness
1,2,1996,/title/tt0111161/,The Shawshank Redemption,1994,142,Drama,9.3,80.0,2529673,28.34,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler
2,3,1996,/title/tt0117951/,Trainspotting,1996,93,Drama,8.1,83.0,665213,16.5,Danny Boyle,Ewan McGregor,Ewen Bremner,Jonny Lee Miller,Kevin McKidd
3,4,1996,/title/tt0114814/,The Usual Suspects,1995,106,"Crime, Drama, Mystery",8.5,77.0,1045626,23.34,Bryan Singer,Kevin Spacey,Gabriel Byrne,Chazz Palminteri,Stephen Baldwin
4,5,1996,/title/tt0108598/,The Wrong Trousers,1993,30,"Animation, Short, Comedy",8.3,None,53316,None,Nick Park,Peter Sallis,Peter Hawkins,None,None

In [10]:
from pandas.io import sql
from pandas.io.parsers.readers import validate_bool_kwarg


for i,row in df1.iterrows():
    sql = "INSERT INTO mydb.imdbtop250 VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
    mycursor1.execute(sql, tuple(row))
    conn1.commit()

We are now set, now let us make some queries

#### Querying our newly created table

##### Query 1

**Note:** Since mycursor1 was created from conn1 with its connection linked to work with "mydb" above, I do not need to explictly call it with any table name in this db again

In [11]:
mycursor1.execute("SELECT * FROM imdbtop250 limit 5")

res1 = mycursor1.fetchall()
print("First 5 records of the table: ")
print(" ")

for i in res1:
    print(i)

First 5 records of the table:

(1, '1996', '/title/tt0076759/', 'Star Wars: Episode IV - A New Hope', '1977', 121, 'Action, Adventure, Fantasy', 8.6, 90, 1299781, 322.74, 'George Lucas', ' Mark Hamill', '  Harrison Ford', '  Carrie Fisher', '  Alec Guinness')
(2, '1996', '/title/tt0111161/', 'The Shawshank Redemption', '1994', 142, 'Drama', 9.3, 80, 2529673, 28.34, 'Frank Darabont', ' Tim Robbins', '  Morgan Freeman', '  Bob Gunton', '  William Sadler')
(3, '1996', '/title/tt0117951/', 'Trainspotting', '1996', 93, 'Drama', 8.1, 83, 665213, 16.5, 'Danny Boyle', ' Ewan McGregor', '  Ewen Bremner', '  Jonny Lee Miller', '  Kevin McKidd')
(4, '1996', '/title/tt0114814/', 'The Usual Suspects', '1995', 106, 'Crime, Drama, Mystery', 8.5, 77, 1045626, 23.34, 'Bryan Singer', ' Kevin Spacey', '  Gabriel Byrne', '  Chazz Palminteri', '  Stephen Baldwin')
(5, '1996', '/title/tt0108598/', 'The Wrong Trousers', '1993', 30, 'Animation, Short, Comedy', 8.3, None, 53316, None, 'Nick Park', ' Peter Sallis', '  Peter Hawkins', None, None)

From the above, we see that this is the same information we have as our df1.

##### Query 2

In [12]:
sql1 = "SELECT * FROM imdbtop250 WHERE RunTime > 100 limit 10"
mycursor1.execute(sql1)

res2 = mycursor1.fetchall()
print("First 10 records of all imdbtop250 titles with RunTime more than 100 minutes:")
print(" ")

for i in res2:
    print(i)

First 10 records of all imdbtop250 titles with RunTime more than 100 minutes:

(1, '1996', '/title/tt0076759/', 'Star Wars: Episode IV - A New Hope', '1977', 121, 'Action, Adventure, Fantasy', 8.6, 90, 1299781, 322.74, 'George Lucas', ' Mark Hamill', '  Harrison Ford', '  Carrie Fisher', '  Alec Guinness')
(2, '1996', '/title/tt0111161/', 'The Shawshank Redemption', '1994', 142, 'Drama', 9.3, 80, 2529673, 28.34, 'Frank Darabont', ' Tim Robbins', '  Morgan Freeman', '  Bob Gunton', '  William Sadler')
(4, '1996', '/title/tt0114814/', 'The Usual Suspects', '1995', 106, 'Crime, Drama, Mystery', 8.5, 77, 1045626, 23.34, 'Bryan Singer', ' Kevin Spacey', '  Gabriel Byrne', '  Chazz Palminteri', '  Stephen Baldwin')
(7, '1996', '/title/tt0117731/', 'Star Trek: First Contact', '1996', 111, 'Action, Adventure, Drama', 7.6, 71, 122819, 92.0, 'Jonathan Frakes', ' Patrick Stewart', '  Jonathan Frakes', '  Brent Spiner', '  LeVar Burton')
(8, '1996', '/title/tt0034583/', 'Casablanca', '1942', 102, 'Drama, Romance, War', 8.5, 100, 551575, 1.02, 'Michael Curtiz', ' Humphrey Bogart', '  Ingrid Bergman', '  Paul Henreid', '  Claude Rains')
(9, '1996', '/title/tt0083658/', 'Blade Runner', '1982', 117, 'Action, Drama, Sci-Fi', 8.1, 84, 736925, 32.87, 'Ridley Scott', ' Harrison Ford', '  Rutger Hauer', '  Sean Young', '  Edward James Olmos')
(10, '1996', '/title/tt0108052/', "Schindler's List", '1993', 195, 'Biography, Drama, History', 8.9, 94, 1292510, 96.9, 'Steven Spielberg', ' Liam Neeson', '  Ralph Fiennes', '  Ben Kingsley', '  Caroline Goodall')
(11, '1996', '/title/tt0033467/', 'Citizen Kane', '1941', 119, 'Drama, Mystery', 8.3, 100, 428750, 1.59, 'Orson Welles', ' Orson Welles', '  Joseph Cotten', '  Dorothy Comingore', '  Agnes Moorehead')
(12, '1996', '/title/tt0110912/', 'Pulp Fiction', '1994', 154, 'Crime, Drama', 8.9, 94, 1948662, 107.93, 'Quentin Tarantino', ' John Travolta', '  Uma Thurman', '  Samuel L. Jackson', '  Bruce Willis')
(14, '1996', '/title/tt0068646/', 'The Godfather', '1972', 175, 'Crime, Drama', 9.2, 100, 1741574, 134.97, 'Francis Ford Coppola', ' Marlon Brando', '  Al Pacino', '  James Caan', '  Diane Keaton')

#### Mysql Aggregate Functions

In [13]:
sql2 = "SELECT IMDByear, ROUND(AVG(Rating),2), ROUND(SUM(Gross),2) FROM imdbtop250 GROUP BY IMDByear"

mycursor1.execute(sql2)
agg1 = mycursor1.fetchall()
print("Average Rating of Movies in a given IMDByear and Total Gross made in that year: ")
print(" ")

for i in agg1:
    print(i)

Average Rating of Movies in a given IMDByear and Total Gross made in that year:

('1996', 7.83, 10371.94)
('1997', 7.94, 12837.39)
('1998', 7.98, 12817.7)
('1999', 8.07, 11181.34)
('2000', 8.09, 11435.71)
('2001', 8.09, 12692.43)
('2002', 8.11, 12859.91)
('2003', 8.13, 14004.74)
('2004', 8.15, 12399.39)
('2005', 8.16, 13195.06)
('2006', 8.18, 12967.02)
('2007', 8.19, 13016.98)
('2008', 8.19, 13595.25)
('2009', 8.2, 16400.35)
('2010', 8.22, 16552.35)
('2011', 8.23, 17497.85)
('2012', 8.23, 18737.71)
('2013', 8.25, 18159.9)
('2014', 8.26, 18158.57)
('2015', 8.25, 19947.59)
('2016', 8.27, 19177.97)
('2017', 8.27, 18346.65)
('2018', 8.28, 18789.37)
('2019', 8.29, 19520.7)
('2020', 8.3, 18958.73)
('2021', 8.31, 18785.83)

#### References

1.  https://www.kaggle.com/datasets/mustafacicek/imdb-top-250-lists-1996-2020